"""
Создайте функцию которая принимает на вход 3 именованных параметра, выведите на печать значения этих параметров,
но только в том случае если они не равны None.
"""
def printThese (a,b,с):
    if a != 'None' and b != 'None' and c != 'None':
        print(a,b,c)

printThese(23,44,67)









