"""
Представьте, что сумма за пользование услугами такси складывается из
базового тарифа в размере $4,00 плюс $0,25 за каждые 140 м поездки.
Напишите функцию, принимающую в качестве единственного параметра
расстояние поездки в километрах и возвращающую итоговую сумму опла-
ты такси.
"""
def taxi(km):
    metr = km * 1000
    formul = 4 + (0.25 * (metr // 140))
    return formul

print(taxi(4))
